#include "common.ch"
#include "inkey.ch"
sele tovmsrt
set orde to tag t1
sele rs2m
set rela to str(sklr,7)+str(mntovp,7) into tovmsrt
set orde to tag t3
netseek('t3','ttnr')
inde on STR(int(rs2m->mntovp/10000))+tovmsrt->nat+str(ppt)+str(mntov) tag s1 to tnatm for ttn=ttnr
go top
if !bof()
   rcrs2mr=recn()
else
   rcrs2mr=1
endif

prNacr=0
apcenr=0
do while .t. // Товарная часть документа по отпускным ценам
   SELE rs2m
   go rcrs2mr
   do while ttn=ttnr
      if deleted()
         skip -1
      else
         exit
      endif
   endd
   if ttn#ttnr
      netseek('t3','ttnr')
   endif
   if przr=1
      foot('F5,F8,F9','Отдел,Вид,Деньги')
   else
      do case
         case gnArm=3.and.who=0
              foot('F5,F8,F9','Отдел,Вид,Деньги')
         case gnArm=3.and.(gnVo=9.or.gnVo=2.or.gnVo=3).and.who<>1
              foot('F2,F3,F4,F5,F6,F7,F8,F9,F10','Дог.ц,Д к,Корр,Отд,Лиц,Аттр,Вид,Ден,БСО')
         othe
              if who#1
                 foot('F3,F4,F5,F6,F7,F8,F9','Доб.Код,Кор,Отд,Лиц,Аттр,Вид,Ден')
              else
                 foot('F4,F5,F7,F8,F9','Корр.,Отдел,Аттр,Вид,Деньги')
              endif
      endc
   endif
  //   IF pstr=0
  //      @2,62 say 'С/Т ВОЗВР    '+iif(bsor#0,'БСО'+str(bsor,2),'     ') color 'r+/n'
  //   ELSE
  //      @2,62 say 'С/Т НЕ ВОЗВР '+iif(bsor#0,'БСО'+str(bsor,2),'     ') color 'gr+/n'
  //   ENDIF
   IF pstr=0
      @ 2,62 say 'С/Т' color 'r+/n'
   ELSE
      @ 2,62 say 'С/Т' color 'gr+/n'
   ENDIF

   IF ptr=1
      @ 2,col()+1 say 'Тара' color 'r+/n'
   ELSE
      @ 2,col()+1 say 'Тара' color 'gr+/n'
   ENDIF

   if bsor#0
      @ 2,col()+1 say 'БСО'+str(bsor,2) color 'w+/n'
   endif

   sele rs2m
   set orde to tag t3
   if gnOt=0
      foror=nil
   else
      foror="getfield('t1','sklr,rs2m->mntovp','tovm','ot')=gnOt"
   endif
   IF !EMPTY(rs1->(FIELDPOS("KopI"))) .AND. !EMPTY(rs1->KopI)
      qIr:=mod(rs1->KopI,100)
      tCen_r:=getfield('t1','gnD0k1,gnVu,gnVo,qIr','soper','tcen')
      cTopHead_TOVAR := nrs2r+"_"+IIF(.T.,;//rs1->Kop # rs1->KopI .AND. !EMPTY(rs1->KopI),;
      ALLTRIM(getfield('t1','tCen_r','tCen','ntcen')),;
      "";
       )
   ELSE
      cTopHead_TOVAR:= nrs2r
   ENDIF
   set orde to tag s1
   do case
      case prZen2r=0
           if prNacr=0
              rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:zen h:'Цена' c:n(9,3) e:svp h:'Сумма' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
           else
              rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:zen h:'Цена' c:n(9,3) e:pzen h:'Наценка' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
           endif
      case prZen2r=1
           if fieldpos('bsvp')=0
              if prNacr=0
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:bzen h:'Цена 2' c:n(9,3) e:roun(kvp*bzen,2) h:'Сумма' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              else
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:bzen h:'Цена 2' c:n(9,3) e:pbzen h:'Наценка' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              endif
           else
              if prNacr=0
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:bzen h:'Цена 2' c:n(9,3) e:bsvp h:'Сумма' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              else
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:bzen h:'Цена 2' c:n(9,3) e:pbzen h:'Наценка' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              endif
           endif
      case prZen2r=2
           if fieldpos('xsvp')=0
              if prNacr=0
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:xzen h:'Цена 3' c:n(9,3) e:roun(kvp*xzen,2) h:'Сумма' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              else
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:xzen h:'Цена 3' c:n(9,3) e:pxzen h:'Наценка' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              endif
           else
              if prNacr=0
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:xzen h:'Цена 3' c:n(9,3) e:xsvp h:'Сумма' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              else
                 rcrs2mr=slcf('rs2m',8,1,11,,"e:mntov h:'Код' c:n(7) e:getfield('t1','sklr,rs2m->mntov','tovm','nat') h:'Наименование' c:c(31) e:getfield('t1','sklr,rs2m->mntov','tovm','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'K' c:n(1) e:xzen h:'Цена 3' c:n(9,3) e:pxzen h:'Наценка' c:n(10,2)",,,1,'ttn=ttnr',foror,'n/bg,n/w',cTopHead_TOVAR)
              endif
           endif
   endc
   sele rs2m
   set orde to tag t3
   go rcrs2mr
   mntovr=mntov
   mntovpr=mntovp
   mktlr=ktl
   mktlpr=ktlp
   zenmr=zen
   prZenmr=pzen
   zenmpr=zenp
   prZenmpr=prZenp
   bzenmr=bzen
   prBZenmr=pbzen
   bzenmpr=bzenp
   prBZenmpr=prBZenp
   xzenmr=xzen
   prXZenmr=pxzen
   xzenmpr=xzenp
   prXZenmpr=prXZenp
   kvpmr=kvp
   svpmr=svp
   srmr=sr
   rs2sertr=sert
   pptmr=ppt
   kfmr=kf
   sfmr=sf
   natr=getfield('t1','sklr,mntovr','tovm','nat')
   store 0 to zenr,prZenr,zenpr,prZenpr,;
              bzenr,prBZenr,bzenpr,prBZenpr,;
              xzenr,prXZenr,xzenpr,prXZenpr
   do case
      case lastkey()=K_ALT_F2  // Наценки/скидки
           if prNacr=0
              prNacr=1
           else
              prNacr=0
           endif
           loop
      case lastkey()=K_ALT_F8.and.(pbzenr=1.or.gnAdm=1)   // По 2-й цене
           do case
              case prZen2r=0
                   prZen2r=1
              case prZen2r=1
                   prZen2r=2
              case prZen2r=2
                   prZen2r=0
           endc
           loop
      case lastkey()=K_INS.and.prdp().and.coptr#'opt'.and.przr=0.and.empty(dfpr).and.(who=2.or.who=3.or.who=4)   // Добавить из справочника
           rtovmslc()
           pere(1)  // Перерасчет без rs3
       case lastkey()=K_DEL.and.prdp().and.coptr#'opt'.and.przr=0.and.mntovr=mntovpr.and.((who=3.or.who=4).or.(empty(dfpr).and.who=2.or.!empty(dfpr).and.who=1)) // Удалить
           rs2mins(2)
           pere(1)  // Перерасчет без rs3
       case lastkey()=K_F4.and.prdp().and.coptr#'opt'.and.przr=0.and.mntovr=mntovpr.and.((who=3.or.who=4).or.(empty(dfpr).and.who=2.or.!empty(dfpr).and.who=1)) // Коррекция
           rs2mins(1)
           pere(1)  // Перерасчет без rs3
      case lastkey()=K_F5 // Отдел
           sele cskle
           if netseek('t1','gnSk')
              gnOt=slcf('cskle',,,,,"e:ot h:'От' c:n(2) e:nai h:'Наименование' c:c(20)",'ot',0,,'sk=gnSk')
              if netseek('t1','gnSk,gnOt')
                 gcNot=nai
                 @ 1,60 say gcNot color 'gr+/n'
              endif
           endif
           sele rs2m
       case lastkey()=K_F8.and.gnCtov=1.and.(gnAdm=1.or.gnRrs2m=1) // Вид
           if rs2vidr=1
              rs2vidr=2
           else
              rs2vidr=1
           endif
           exit
      case lastkey()=K_F9 // Деньги
           esc_rr=1
           exit
      case lastkey()=K_ESC // Выход
           esc_r=1
           exit
      case lastkey()=K_ENTER // По партиям
           rs2vidr=2
           rs2mm()
           rs2vidr=1
      case lastkey()=K_F10.and.gnCtov=1 // БСО
           rs2bso()
       case lastkey()=K_F2.and.przr=0.and.empty(dfpr).and.(who=2.or.who=3.or.who=4).and.(gnVo=9.or.gnVo=2.or.gnVo=3)
        // Скидка/Наценка в цену
            if empty(dopr).or.gnAdm=1
               RsDogZen()
            else
               wmess('Документ отгружен',1)
            endif
       case lastkey()=K_F6.and.who#0.and.!(gnArm=2.or.gnArm=6) // Лицензии
            lic(kplr)
       case lastkey()=K_F7.and.prdp() //.and.przr=0.and.(gnAdm=1.or.gnRdsp=1) // Аттрибуты
            rdsp()
      case lastkey()=K_F3.and.prdp().and.coptr#'opt'.and.przr=0.and.empty(dfpr).and.(who=2.or.who=3.or.who=4)  // Добавить код
           @ 24,0 clea
           mntovr=1
           do while mntovr#0
              mntovr=0
              setcolor('g/n,n/g')
              @ 24,1 say 'Введите код ' get mntovr pict '9999999' valid ChkGr350m()
              read
              if mntovr#0
                 sele tovm
                 if netseek('t1','sklr,mntovr')
                    if gnCtov=1
                       if bsor#0.and.int(ktlr/1000000)>1
                          tgrpr=getfield('t1','int(mntovr/10000)','cgrp','tgrp')
                          if tgrpr=0
                             wmess('БСО - Только АЛКОГОЛЬ!!!',2)
                             ktlr=0
                             loop
                          endif
                       endif
  //                       obncen(mntovr)
                    endif
                    rs2mins(0)
                    pere(1)  // Перерасчет без rs3
                    exit
                 else
                    wmess('Нет продукции с таким кодом',2)
                 endif
               endif
            endd
   endc
   sele rs2m
enddo


func rs2mm()
do while .t. // Товарная часть документа по партиям
   sele rs2
   set orde to tag t3
   if !netseek('t3','ttnr,mntovpr,mktlpr,pptmr,mntovr,mktlr')
      exit
   endif
   foot('','')
   rcrs2r=slcf('rs2',10,1,7,,"e:ktl h:'Код' c:n(9) e:getfield('t1','sklr,rs2->ktl','tov','nat') h:'Наименование' c:c(29) e:getfield('t1','sklr,rs2->ktl','tov','nei') h:'Изм' c:c(3) e:kvp h:'Количество' c:n(9,3) e:otv h:'O' c:n(1) e:zen h:'Цена' c:n(9,3) e:svp h:'Сумма' c:n(10,2)",,,1,'ttn=ttnr.and.mntov=mntovr',,,str(mntovr,7)+' '+alltrim(natr)+' по партиям')
   sele rs2
   go rcrs2r
   do case
       case lastkey()=K_ESC // Выход
            esc_r=1
            exit
   endc
enddo

return
**************
func arfrm()
  // в субаренду
**************
local i
  // 69 строк
*??chr(27)+'E'+chr(27)+'&l1S'+chr(27)+'&l1h25a0O'+chr(27)+'&l3C'+chr(27)+'(3R'+chr(27)+'(s0p29.00h0s1b4102T'+chr(27)  // Книжная А4
??chr(27)+'&l5C'
?space(60)+'Договiр суборенди майна'
?space(63)+'№'+'18005'+'/'+str(ttnr,6)
*?space(63)+'№'+str(gnKln_c,8)+'/'+str(ttnr,6)
?'м.Київ'+space(130)+dtous(dvpr)
?subs(getfield('t1','gnKkl_c','kln','nklprn'),1,110)+'(у подальшому именується "Орендар"), в особi'
?'директора Калюжного В.Ю.'+repl('_',55)+', що дiє на пiдставi статуту'+repl('_',26)+', з однiєї сторони, та'
?subs(getfield('t1','kplr','kln','nklprn'),1,110)+'(у подальшому iменується "Суборендар"), в особi'
?repl('_',70)+', що дiє на пiдставi '+repl('_',33)+', з другої сторони, в подальшому'
?'разом iменуються "Сторони", а кожна окремо - "Сторона", за погодженням з власником майна, що орендується - ПАТ "Оболонь"(у подальшому iменується "Власник"),'
?'уклали цей договiр суборенди майна, який надалi iменується "Договiр", про наступне:'
?space(60)+'1.ПРЕДМЕТ ДОГОВОРУ'
?'  1.1 Орендар передає Субарендаревi у строкове платне користування(оперативну субаренду), а Субарендар приймає торгово-рекламне обладнання(надалi именуеться'
?'"Майно"), та зобов"язується сплачувати Орендарю орендну плату.'
?'  1.2 Перелiк,модель,заводський номер (за наявностi),рiк виробницьтва Майна, мiсцезнаходження, вартiсть та кiлькiсть Майна зазначаються в наступнiй таблицi:'
??chr(27)+'&l3C'
?'┌───┬───────────────────────────────────────────┬──────────────┬───────────┬─────────┬──────────────┬──────┬───────────────────────────────────────────────┐'
?'│NN │       Перелiк та модель Майна             │  Заводський  │Iнвентарний│Кiлькiсть│Вартiсть Майна│ Рiк  │            Мiсцезнаходження Майна             │'
?'│   │                                           │ номер Майна  │номер Майна│  Майна, │  за одиницю  │вироб-│   (мiсто, вулиця, будинок, назва торгової     │'
?'│   │                                           │              │           │ одиниць │(грн. без ПДВ)│ництва│            точки з вивески)                   │'
?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
if kolposr>11
   for i=1 to 11
?'│   │XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│XXXXXXXXXXXXXX│XXXXXXXXXXX│XXXXXXXXX│XXXXXXXXXXXXXX│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
   next
?'│   │ Всього:                                   │XXXXXXXXXXXXXX│XXXXXXXXXXX│XXXXXXXXX│XXXXXXXXXXXXXX│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
?'└───┴───────────────────────────────────────────┴──────────────┴───────────┴─────────┴──────────────┴──────┴───────────────────────────────────────────────┘'
else
  nn_rr=1
  kol_rr=0
  sm_rr=0
  sele rs2
  if netseek('t3','ttnr')
     do while ttn=ttnr
*?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','nat'),1,43)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','zn'),1,14)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+subs(getfield('t1','kgpr','kln','adr'),1,47)+'│'
adr_rr=alltrim(getfield('t1','kgpr','kln','adr'))
knasp_r=getfield('t1','kgpr','kln','knasp')
nnasp_r=alltrim(getfield('t1','knasp_r','knasp','nnasp'))
adr_r=padr(nnasp_r+' '+adr_rr,47,' ')
*adr_r=subs(getfield('t1','kgpr','kln','adr'),1,47)
store '' to znr,zn1rr,zn2rr,zn3rr
znr=alltrim(getfield('t1','rs2->mntov','ctov','zn'))
kolstr=12
if len(znr)<=14
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+subs(getfield('t1','rs2->mntov','ctov','zn'),1,14)+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
else
   zn1rr=subs(znr,1,10)
   fzn1r=padr(zn1rr,14)
   zn2rr=subs(znr,11,10)
   fzn2r=padr(zn2rr,14)
   zn3rr=subs(znr,21,10)
   fzn3r=padr(zn3rr,14)
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+fzn1r+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
   if !empty(zn2rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn2r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
   if !empty(zn3rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn3r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
endif
?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
        nn_rr=nn_rr+1
        kol_rr=kol_rr+rs2->kvp
        sm_rr=sm_rr+rs2->svp
        sele rs2
        skip
     endd
  endif
  for i=1 to kolstr-nn_rr
?'│   │XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│XXXXXXXXXXXXXX│XXXXXXXXXXX│XXXXXXXXX│XXXXXXXXXXXXXX│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
  next
?'│   │ Всього:                                   │XXXXXXXXXXXXXX│XXXXXXXXXXX│'+str(kol_rr,9)+'│'+str(sm_rr,14,2)+'│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
?'└───┴───────────────────────────────────────────┴──────────────┴───────────┴─────────┴──────────────┴──────┴───────────────────────────────────────────────┘'
endif
??chr(27)+'&l5C'
?'  За необхiдностi, перелiк, модель, заводський номер (за наявностi),рiк виробницьтва Майна,миiцезнаходження,вартiсть та кiлькiсть Майна можуть зазначатися в'
?'спецiфiкацiї(надалi iменується "Спецiфiкацiя"),що оформлюється Сторонами та погоджується Власником у виглядi додатку до даного Договору i є його невiд"ємною'
?'частиною'
?'  1.3 Суборендар  повiдомлений,  що  право  власностi  на Майно належить ПАТ "Оболонь". У  випадку  припинення  дiї  договору  оренди  Майна, укладеного мiж'
?'Власником та Орендарем, Суборендар зобов"язуеться повернути Майно Власнику протягом 10 (десяти) робочих днiв з дати направлення Власником  Субарендарю такої'
?'вимоги або, за умови наявностi вiдповiдної вимоги вiд Власника, Суборендар зобов"язується переукласти аналогiчний договiр субаренди з iншим орендарем Майна.'
?'  1.4 Майно  надається Субарендарю у  користування з метою популяризацiї, демонстрацiї, зберiгання та реалiзацiї  продукцiї, що виробляється / реалiзується'
?'Власником та корпоративними пiдприємствами Власника.Пiд корпоративними пiдприємствами Власника слiд вважати: ДП ПАТ "Оболонь" "Пивоварня Зиберта", ДП ПАТ'
?'"Оболонь"  " Красилiвське " , ВАТ  "Охтирський  пивоварний  завод", ПАТ " Бершадський  пивокомбiнат "  та  ВАТ " Севастопольский  пивобезалкогольний завод"'
?'Субарендар не має права використовувати Майно для iнших цiлей'
?space(50)+'2.УМОВИ СУБАРЕНДИ ТА ПОРЯДОК ЕКСПЛУАТАЦIЇ МАЙНА'
?'  2.1 Стан Майна на момент передання в суборенду: в дiючему станi, технично справне, комплектне, вiдповiдає технiчним нормам та придатне  для використання у'
?'вiдповiдностi до мети субаренди, визначеної у п. 1.4 даного Договору. В разi необхiдностi Орендар передає Субарендаревi наявнi у  Орендаря  копiї  технiчної'
?'документацiї, необхiдної для експлуатацiї Майна.'
?' 2.2. Факт передачi Майна в суборенду пiдтверджується актом прийому-передачi, який пiдписується уповноваженими представниками Сторiн, погоджується'
?'уповноваженою особою Власника та скрiплюється печатками Сторiн i Власника. Акт прийому/передачi Майна в суборенду є невiд"ємною частиною цього Договору.'
?' Обов"язок пiдготовки акта прийому-передачi Майна в суборенду лежить на Oрендарi.'
?' 2.3. Майно повинне бути повернуто Суборендарем та прийняте Орендарем/Власником протягом 10 (десяти) робочих днiв з дати закiнчення дiї Договору (в тому числi'
?'дострокового). Суборендар несе ризик випадкової загибелi, пошкодження або втрати Майна до моменту його фактичного повернення Орендарю або Власнику.'
?' 2.4. Факт повернення майна iз суборенди пiдтверджується актом прийому-передачi, який пiдписується уповноваженими представниками Сторiн, погоджується'
?'уповноваженою особою Власника та скрiплюється печатками Сторiн i Власника. Акт прийому-передачi Майна iз суборенди є невiд"ємною частиною цього Договору.'
?'Обов"язок пiдготовки акта прийому-передачi Майна iз суборенди лежить на Суборендарi.'
?' 2.5. Суборендар зобов"язаний повернути Майно Орендарю/Власнику в тому ж самому станi, в якому воно було передано в суборенду з урахуванням нормального зносу.'
?' 2.6. Суборендар не має права без письмового узгодження iз Орендарем та Власником передавати Майно, будь-якi права та обов"язки за Даним Договором третiм'
?'особам.'
?' 2.7. Представники Орендаря та Власника мають право здiйснювати необмежений контроль за використанням Суборендарем Майна як шляхом безпосередньої'
?'перевiрки порядку експлуатацiї Суборендарем Майна i проведення iнвентаризацiї, так i шляхом направлення Суборендарю вiдповiдних запитiв з вимогою про надання'
?'iнформацiї i документiв, пiдтверджуючих поточний стан Майна та порядок його використання. При необхiдностi, контроль цiльового використання Майна можуть'
?'здiйснювати уповноваженi Орендарем або Власником посадовi особи Торгово-промислової палати України.'
?' 2.8. Суборендар зобов"язаний негайно забезпечити представникам Орендаря, Власника та їх уповноваженим особам умови для безперешкодного доступу до Майна i, за'
?'їх першою вимогою, надати їм всi наявнi документи i iнформацiю вiдносно експлуатацiї Майна.'
?' 2.9. Технiчне обслуговування, санiтарна обробка Майна (згiдно чинної iнструкцiї) та повiрка засобiв вимiрювальної технiки (манометри) здiйснюються Орендарем за'
?'власний рахунок. Гарантiйний ремонт Майна проводиться виробником Майна у вiдповiдностi до технiчного паспорту одиницi Майна. Пiслягарантiйнi ремонтнi роботи'
?'Майна проводяться Орендарем або Власником.'
?''
?''
?'Вiд Власника: ___________________________      Вiд Орендаря: ____________В.Ю.Калюжний________                     Вiд Суборендаря: ___________________________'
?'	                        М.П.                                         М.П.	                                                                М.П.'
eject
??chr(27)+'&l3C'
?' 2.10. Переобладнання, переоснащення, ремонт, будь-якi полiпшення Майна тощо, можуть здiйснюватися Суборендарем за попередньою письмовою згодою Орендаря'
?'та Власника.'
?' 2.11. Суборендар експлуатує Майно вiдповiдно до особливостей та правил його експлуатацiї, якi вказанi в технiчному паспортi на Майно або iншiй супровiднiй'
?'документацiї. В разi, якщо Суборендарю не передається технiчна та/чи iнша супровiдна документацiя на Майно, Суборендар здiйснює експлуатацiю Майна вiдповiдно до'
?'вимог, що звичайно ставляться до аналогiчного Майна. Пiдписанням акту прийому-передачi Майна Суборендар пiдтверджує, що йому вiдомi усi особливостi та правила'
?' експлуатацiї Майна.'
?' 2.12. В разi виникнення ушкоджень чи втрати, або при загрозi виникнення ушкоджень чи втрати Майна Суборендар негайно повiдомляє Орендаря або Власника про'
?'такi обставини, а також застосовує всi заходи щодо запобiгання нанесення шкоди Майну чи його втратi.'
?''
?'                         3. ОРЕНДНА ПЛАТА ТА РОЗРАХУНКИ ЗА ДОГОВОРОМ'
?' 3.1. Розмiр орендної плати за користування однiєю одиницею Майна становить 1 (одна) гривня (з урахуванням ПДВ) за один календарний рiк.'
?' 3.2. Орендна плата за весь термiн дiї даного Договору сплачується Суборендарем шляхом перерахування грошових коштiв на рахунок Орендаря протягом перших 10'
?'(десяти) робочих днiв з дати такої пролонгацiї.'
?' 3.3.Датою виконання Суборендарем зобов"язань перед Орендарем зi сплати орендної плати є дата зарахування вiдповiдних грошових коштiв на рахунок Орендаря.'
?' 3.4. Амортизацiйнi вiдрахування на Майно нараховує та залишає у своєму розпорядженнi Власник. Амортизацiйнi вiдрахування використовуються вiдповiдно до'
?'чинного законодавства України.'
?''
?'                         4. ПРАВА ТА ОБОВ"ЯЗКИ ОРЕНДАРЯ ТА ВЛАСНИКА'
?' 4.1. Орендар зобов"язується:'
?' 4.1.1. передати Майно Суборендарю i в разi потреби надати допомогу з його технiчної установки на мiсцi, погодженому з Орендарем;'
?' 4.1.2. нести витрати по технiчному обслуговуванню, санiтарнiй обробцi Майна та повiрцi засобiв вимiрювальної технiки (манометри);'
?' 4.1.3. забезпечити у разi необхiдностi здiйснення пiслягарантiйного ремонту Майна.'
?' 4.2. Орендар має право:'
?' 4.2.1. вимагати сплати Суборендарем орендної плати та компенсацiї видаткiв, пов"язаних з використанням Майна Суборендарем.'
?' 4.3. Власник зобов"язується:'
?' 4.3.1. забезпечити органiзацiю проведення виробником гарантiйного ремонту Майна та, у разi необхiдностi, забезпечити здiйснення пiслягарантiйного ремонту Майна.'
?' 4.4. Власник та Орендар мають право:'
?' 4.4.1. контролювати цiльове використання Суборендарем Майна у вiдповiдностi до положень даного Договору;'
?' 4.4.2. вказати Суборендарю визначенi Власником стандарти використання Майна, розмiщення продукцiї та умови мерчайдазингу у вiдповiдностi до мети суборенди,'
?'зазначеної в п. 1.4. даного Договору.'
?''
?'                          5. ПРАВА ТА ОБОВ"ЯЗКИ СУБОРЕНДАРЯ'
?' 5.1. Суборендар зобов"язується:'
?' 5.1.1. з моменту прийняття Майна в суборенду i до моменту повернення Майна iз суборенди, здiйснювати в своїх торгових точках продаж, пiдтримувати наявнiсть та'
?'асортимент продукцiї, що виробляється/реалiзується Власником та корпоративними пiдприємствами Власника, згiдно укладеного мiж Орендарем та Суборендарем'
?'договору купiвлi-продажу (договору поставки) продукцiї виробництва Власника та iз врахуванням обумовлених мiж Сторонами умов та обсягiв.'
?' 5.1.2. використовувати Майно виключно у вiдповiдностi до мети суборенди, визначеної у п. 1.4. даного Договору та у вiдповiдностi до стандартiв використання Майна,'
?'розмiщення продукцiї i умов мерчайдазингу, визначених Власником;'
?' 5.1.3. утримувати Майно у належному технiчному станi та дотримуватися належного режиму експлуатацiї та зберiгання Майна, а також забезпечувати збереження'
?'нанесених на Майно маркувань, включаючи найменування бренду, таблички, наклейки та iншi позначення, що мiстять заводськi та iнвентарнi номери, номери агрегатiв'
?'а/або iншу iнформацiю, нанесену виробником Майна чи Власником;'
?' 5.1.4. провести iнструктаж своїх працiвникiв з метою належного виконання умов даного Договору;'
?' 5.1.5. сприяти та не перешкоджати представникам та iншим уповноваженим особам Орендаря або Власника здiйснювати контроль за цiльовим використанням Майна,'
?'контролювати його робочий стан, здiйснювати вiдновлення Майна, проводити необхiднi ремонтнi та сервiснi роботи;'
?' 5.1.6. самостiйно i за свiй рахунок нести видатки, що пов"язанi з експлуатацiєю Майна;'
?' 5.1.7. самостiйно i за свiй рахунок отримувати у вiдповiдних державних органах та установах всi передбаченi законодавством України дозволи i погодження щодо'
?'розмiщення та використання Майна з метою проведення дiяльностi та реалiзацiї продукцiї, що виробляється/реалiзується Власником та корпоративними пiдприємствами'
?'Власника;'
?' 5.1.8. повiдомляти Орендаря або Власника про необхiднiсть проведення ремонту Майна протягом одного робочого дня з моменту виходу його з ладу;'
?' 5.1.9. самостiйно i за свiй рахунок виконувати всi вимоги з екологiчної, санiтарної, пожежної безпеки, санiтарних правил та норм;'
?' 5.1.10. самостiйно i за свiй рахунок нести вiдповiдальнiсть перед третiми особами в разi спричинення будь-якої шкоди чи збитку третiм особам в наслiдок експлуатацiї'
?'Майна;'
?' 5.1.11. нести всi ризики спричинення шкоди Майном власному майну та майну третiх осiб;'
?' 5.1.12. самостiйно i за свiй рахунок забезпечити належне збереження Майна;'
?' 5.1.13. протягом 10 (десяти) робочих днiв пiсля закiнчення дiї Договору (в т.ч. дострокового) повернути Майно Орендарю (а в разi отримання вiдповiдної вимоги'
?'i Власнику) у дiючому станi, технiчно справне та комплектне, з урахуванням його нормального зносу;'
?' 5.1.14. унеможливити доступ до Майна некомпетентних та не уповноважених осiб;'
?' 5.1.15. своєчасно здiйснювати оренднi платежi за користуванням Майном у вiдповiдностi до п. 3.1. та п. 3.2. даного Договору;'
?' 5.1.16. не використовувати Майно для застави;'
?' 5.1.17. не передавати Майно третiм особам без письмової згоди Орендаря та Власника. При передачi Майна третiм особам, Суборендар зобов"язується попередити'
?'даних осiб про те, що право власностi на Майно належить ПАТ "Оболонь", яке має право вимагати повернення Майна у безспiрному порядку в користування та володiння'
?'безпосередньо ПАТ "Оболонь" у випадках, передбачених договором оренди, даним Договором та чинним законодавством України, а також про права представникiв та'
?'уповноважених осiб Орендаря та Власника щодо здiйснення контролю за цiльовим використанням Майна;'
?' 5.1.18. не змiнювати мiсцезнаходження Майна, яке вказано в п. 1.2. даного Договору (або в Специфiкацiї) без письмового погодження такого перемiщення з'
?'Орендарем та Власником.'
?' 5.1.19. завчасно письмово повiдомляти Орендаря та Власника про змiну, як свого мiсцезнаходження, так i мiсцезнаходження Майна (в т.ч. для виконання умов п.'
?'5.1.18. даного Договору) не менше нiж за 10 (десять) робочих днiв до такої змiни;'
?' 5.1.20. своєчасно (не менше нiж за 15 (п"ятнадцять) робочих днiв) письмово повiдомляти Власника та Орендаря про плановi/очiкуванi: реорганiзацiю, банкрутство,'
?'змiну власникiв, змiну юридичної або фактичної адреси, припинення дiяльностi Суборендаря;'
?' 5.1.21. негайно повiдомляти Власника та Орендаря про факти накладення арешту на Майно, опечатування примiщень в яких знаходиться Майно, пожеж та затоплень,'
?'а також про iншi подiї, що загрожують збереженню Майна.'
?' 5.1.22. розмiстити Майно на мiсцевостi або в примiщеннi згiдно наступної план-схеми:'
?''
?'┌───────────────────────────────────────────────────────────────────────────────────────────────────┬──────────────────────────────────────────────────────┐'
?'│                                               Схема                                               │                     Примiтки                         │'
?'├───────────────────────────────────────────────────────────────────────────────────────────────────┼──────────────────────────────────────────────────────┤'
?'│┌──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┐│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤│                                                      │'
?'││      │      │      │      │      │      │      │      │      │      │      │      │      │      ││───────────────────────────────────────────────────── │'
?'│└──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┘│                                                      │'
?'└───────────────────────────────────────────────────────────────────────────────────────────────────┴──────────────────────────────────────────────────────┘'
?''
?' 5.2. Суборендар має право:'
?' 5.2.1. користуватися Майном у вiдповiдностi до умов цього Договору;'
?' 5.2.2. повiдомити Орендаря або Власника про будь-який дефект Майна, необхiднiсть його ремонту або вимагати замiни Майна в разi неможливостi його подальшого'
?'використання.'
?''
?'                          6.ВIДПОВIДАЛЬНIСТЬ ТА ВIДШКОДУВАННЯ ЗБИТКIВ'
?' 6.1. Вiдповiдальнiсть перед Орендарем та Власником за дiї наступного орендаря в повному розмiрi i в перше чергу несе Суборендар по даному Договору. У випадку'
?'невиконання умов даного роздiлу Договору, Суборендар вiдшкодовує Орендарю та власнику завданi збитки, в тому числi i втрачену вигоду.'
?' 6.2. У випадку втрати (повного знищення) Суборендарем Майна (окрiм випадкiв, що мають пiдтвердження актами вiдповiдних органiв i якi виникли внаслiдок дiї'
?'обставин непереборної сили) або неповерненнi Майна у вiдповiдностi з п. 2.3. даного Договору. Суборендар зобов"язаний вiдшкодувати Орендарю (або за письмовою'
?'вимогою i безпосередньо Власнику) вартiсть Майна, вказану в п.1.2. даного Договору (або в Специфiкацiї), iз врахуванням ПДВ, якщо iнша сума вiдшкодування не'
?'буде додатково узгоджена мiж сторонами та Власником.'
?''
?''
?''
?'Вiд Власника: _________________________                  Вiд Орендаря: __________В.Ю.Калюжний_________              Вiд суборендаря: _________________________'
?'     		               М.П.	                                                  М.П.	                                                          М.П.'
?'Друга сторiнка Договору суборенди майна №'+'18005'+'/'+str(ttnr,6)+' вiд '+dtous(dvpr)
eject
*??chr(27)+'E'+chr(27)+'&l0S'+chr(27)+'&l1h25a0O'+chr(27)+'&l4C'+chr(27)+'(3R'+chr(27)+'(s0p29.00h0s1b4102T'+chr(27)  // Книжная А4
??chr(27)+'&l0S4C'
?' 6.3. У випадку пошкодження Майна або втрати (повного знищення) комплектуючих частин до Майна, та при умовi наявностi при цьому вини Суборендаря (якщо це'
?'буде визнано технiчним фахiвцем Орендаря або Власника, про що складається вiдповiдний акт), Суборендар зобовiязаний вiдшкодувати Орендарю/Власнику вартiсть'
?'вiдновлення (ремонту) Майна або вартiсть втрачених (знищених) комплектуючих частин до Майна.'
?' 6.4. У випадку, якщо Майно передано Суборендарю в упаковцi (сумцi-тубi) то Суборендар зобов"язується зберiгати її в належному станi та повернути Майно'
?'Орендарю/Власнику в данiй упаковцi (сумцi-тубi). За кожну не повернену упаковку (сумку-тубу), в якiй було отримано Майно, Суборендар зобов"язується сплатити'
?'Орендарю (або за умови письмової вимоги i Власнику) штраф у розмiрi 100 (сто) гривень (в т.ч. ПДВ).'
?' 6.5. У випадку порушення Суборендарем передбаченого даним Договором строку повернення Майна Орендарю або Власнику, Суборендар сплачує вiдповiдно'
?'Орендарю або Власнику пеню в розмiрi 0,5% вiд вартостi неповернутого своєчасно  Майна, що вказана в п. 1.2. даного Договору (або в Специфiкацiї), за кожний день'
?'затримки повернення.'
?' 6.6. У випадку порушення Суборендарем зобовiязань передбачених п. 5.1.2. даного Договору, Суборендар сплачує Орендарю штраф у розмiрi 10% вiд вартостi Майна,'
?'що вказана в п. 1.2. даного Договору (або в Специфiкацiї), за кожний факт використання Майна не у вiдповiдностi до мети суборенди. Факт належного використання'
?'Майна пiдтверджується актом, що пiдписується Сторонами, а у випадку ухилення Суборендаря вiд пiдписання акту i одностороннiм актом Орендаря з вiдповiдною'
?'вiдмiткою.'
?' 6.7. У випадку невиконання Суборендарем зобовiязань, передбачених п.п. 5.1.5., 5.1.17. та 5.1.18. даного Договору, Суборендар сплачує Орендарю або Власнику штраф'
?'за кожен окремий випадок в розмiрi 2 000,00 (двох тисяч гривень 00 коп.). Належним пiдтвердженням таких фактiв буде акт складений за участю Орендаря або Власника'
?'та Суборендаря, а у випадку ухилення Суборендаря вiд пiдписання акту i одностороннiм актом Орендаря або Власника з вiдповiдною вiдмiткою. '
?' 6.8. У випадку прострочення сплати орендної плати вiдповiдно до п. 3.1. та п. 3.2. даного Договору, Суборендар сплачує на користь Орендаря пеню в розмiрi'
?'подвiйної облiкової ставки НБУ, яка дiяла в перiод прострочення, вiд суми простроченої орендної плати за кожний день прострочення сплати.'
?' 6.9. Орендар та Власник не вiдповiдатимуть за будь-якi пошкодження, що стануться внаслiдок неправильної експлуатацiї Майна Суборендарем або несправностi'
?'електричної мережi у Суборендаря.'
?' 6.10. Сторона не нестиме вiдповiдальностi за порушення умов даного Договору, якщо порушення сталося не з її вини i якщо Сторона доведе, що нею було вжито всiх'
?'необхiдних заходiв щодо належного виконання умов даного Договору.'
?'                          7.СТРОК ДiЇ ДОГОВОРУ, ПОРЯДОК РОЗiРВАННЯ'
?' 7.1. Даний Договiр вважається укладеним i набирає чинностi з дати його пiдписання Сторонами, погодження Власником.'
?' 7.2. Даний Договiр укладається термiном на 1 (один) календарний рiк, якщо iнше випливатиме з тексту цього Договору або iншого законодавства України.'
?' 7.3. Якщо Суборендар продовжує користуватися Майном пiсля закiнчення термiну дiї Договору, то строк дiї даного Договору подовжуються ще на один календарний рiк.'
?' 7.4. Даний Договiр припиняє свою дiю достроково:'
?' 7.4.1. у випадку припинення дiї договору оренди Майна укладеного мiж Власником та Орендарем. Датою закiнчення дiї даного Договору, в такому випадку,'
?'вважатиметься дата направлення Власником письмового повiдомлення Суборендарю про припинення дiї даного Договору;'
?' 7.4.2. у випадку припинення дiї укладеного мiж Орендарем та Суборендарем договору купiвлi-продажу (договору поставки) продукцiї, що виробляється/реалiзується'
?'Виробником та його корпоративними пiдприємствами. Датою закiнчення дiї даного Договору, в такому випадку, вважатиметься дата припинення дiї вiдповiдного'
?'договору купiвлi-продажу (договору поставки) продукцiї.'
?' 7.5. Орендар або Власник мають право достроково розiрвати цей Договiр, шляхом письмового повiдомлення Суборендаря за 10 (десять) календарних днiв до дати'
?'розiрвання, в разi, якщо:'
?' 7.5.1. Суборендар використовує Майно в порушення умов Договору та/або цiльового призначення Майна;'
?' 7.5.2. Суборендар без дозволу Орендаря та Власника передав Майно, його частину, в користування (подальшу оренду) третiй особi;'
?' 7.5.3. Суборендар своєю недбалою поведiнкою або бездiяльнiстю створює загрозу пошкодження, втрати або знищення Майна.'
?' 7.6. Орендар має право вiдмовитись вiд цього Договору в разi, якщо Суборендар прострочив сплату орендної плати понад один календарний мiсяць. В такому випадку,'
?'Орендар письмово повiдомляє Суборендаря про припинення дiї даного Договору за 10 (десять)календарних днiв до запланованого припинення.'
?' 7.7. Суборендар має право вiдмовитись вiд цього Договору в разi, якщо Орендар або Власник не виконують свої зобов"язання з проведення ремонту Майна. В такому'
?'випадку, Суборендар письмово повiдомляє Орендаря та Власника про припинення дiї даного Договору за 10 (десять) календарних днiв до запланованого припинення.'
?' 7.8. У будь-який час Сторони та Власник можуть прийти до згоди про закiнчення дiї даного Договору, про що буде укладено вiдповiдну додаткову угоду до цього'
?'Договору.'
?' 7.9. Закiнчення строку дiї цього Договору не звiльняє Сторони вiд вiдповiдальностi за його порушення, яке мало мiсце пiд час дiї Договору. В частинi виконання'
?'зобов"язань мiж Сторонами, даний Договiр дiє до моменту повного виконання зобов"язань Сторонами.'
?'                          8.IНШI УМОВИ'
?' 8.1. Цей договiр складено у трьох автентичних примiрниках, що мають рiвну юридичну силу, по одному примiрнику для кожної iз Сторiн та один примiрник для'
?'Власника.'
?' 8.2. Даний Договiр може бути змiнений або доповнений виключно за письмовою згодою Сторiн та письмовим погодженням iз Власником.'
?' 8.3. Усi додатки, доповнення та акти прийому-передачi до цього Договору є його невiд"ємними частинами, укладаються у письмовiй формi в трьох екземплярах та'
?'пiдписуються уповноваженими особами Сторiн, погоджуються уповноваженою особою Власника i скрiплюються печатками.'
?' 8.4. Сторони та Власник погодили, що з дати набуття чинностi даним Договором, втрачають свою юридичну силу (за винятком положень по взаєморозрахункам) всi'
?'ранiше укладенi та пiдписанi за участю Сторiн та Власника угоди (договори) оренди (суборенди), що мають безпосереднє вiдношення стосовно Майна, яке'
?'передається в суборенду по даному Договору.'
?' 8.5. Сторони зобов"язуються своєчасно повiдомляти одна iншу про змiну вказаних ними в цьому Договорi реквiзитiв.'
?' 8.6. Усi спори, що виникають з даного Договору або пов"язанi з ним, вирiшуються шляхом переговорiв мiж Суборендарем, Орендарем та Власником. Якщо'
?'вiдповiдний спiр не можливо вирiшити шляхом переговорiв, вiн вирiшується в судовому порядку за встановленою пiдвiдомчiстю та пiдсуднiстю такого спору'
?'вiдповiдно до чинного в Українi законодавства.'
?' 8.7. В усьому, що не передбачено даним Договором, Сторони та Власник керуються чинним законодавством України.'
*?' 8.8. Власник має статус платника податку на прибуток на загальних умовах вiдповiдно до Закону України "Про оподаткування прибутку пiдприємства".'
*?' 8.9. Орендар __________ статус платника податку на прибуток на загальних умовах вiдповiдно до Закону України "Про оподаткування прибутку пiдприємств".'
*?' 8.10. Суборендар ___________ статус платника податку на прибуток на загальних умовах вiдповiдно до Закону України "Про оподаткування прибутку пiдприємств".'
*?' 8.11. У зв"язку iз тим, що Майно, яке передається в суборенду за цим Договором, не є державною або комунальною власнiстю, Сторони домовились, що дiя Закону'
?' 8.8. У зв"язку iз тим, що Майно, яке передається в суборенду за цим Договором, не є державною або комунальною власнiстю, Сторони домовились, що дiя Закону'
?'України "Про оренду державного та комунального майна" не розповсюджується на правовiдносини, якi виникають з цього Договору.'
?''
?''
?''
?'                          9.ЮРИДИЧНI РЕКВIЗИТИ ТА ПIДПИСИ СТОРIН'
kob1r=getfield('t1','gnKkl_c','kln','kb1')
kob2r=getfield('t1','kplr','kln','kb1')
psser=getfield('t1','kplr','kln','psse')
psnr=getfield('t1','kplr','kln','psn')
psdtvr=getfield('t1','kplr','kln','psdtv')
pskvr=getfield('t1','kplr','kln','pskv')
??chr(27)+'&l3C'
?'┌'+repl('─',78)+'┬'+repl('─',78)+'┐'
?'│'+padc('Орендар:',78)+'│'+padc('Cуборендар:',78)+'│'
?'│'+'Найменування:'+subs(getfield('t1','gnKkl_c','kln','nklprn'),1,65)+'│'+'Найменування:'+subs(getfield('t1','kplr','kln','nklprn'),1,65)+'│'
?'│'+'Адреса:'+subs(getfield('t1','gnKkl_c','kln','adr'),1,71)+'│'+'Адреса:'+subs(getfield('t1','kplr','kln','adr'),1,71)+'│'
?'│'+'Телефон: '+getfield('t1','gnKkl_c','kln','tlf')+' Факс: '+space(52)+'│'+'Телефон: '+getfield('t1','kplr','kln','tlf')+' Факс: '+space(52)+'│'
?'│'+'Код в ЄДРПОУ '+str(getfield('t1','gnKkl_c','kln','kkl1'),10)+' IПН '+str(getfield('t1','gnKkl_c','kln','nn'),12)+space(38)+'│'+'Код в ЄДРПОУ '+str(getfield('t1','kplr','kln','kkl1'),10)+' IПН '+str(getfield('t1','kplr','kln','nn'),12)+space(38)+'│'
?'│'+'Св-во платника ПДВ '+getfield('t1','gnKkl_c','kln','nsv')+' п/р '+getfield('t1','gnKkl_c','kln','ns1nds')+space(19)+'│'+'Св-во платника ПДВ '+getfield('t1','kplr','kln','nsv')+' п/р '+getfield('t1','kplr','kln','ns1nds')+space(19)+'│'
?'│'+'в '+getfield('t1','kob1r','banks','otb')+' МФО '+str(val(kob1r),6)+space(25)+'│'+'в '+getfield('t1','kob2r','banks','otb')+' МФО '+str(val(kob2r),6)+space(25)+'│'
?'│'+space(78)+'│Паспорт: серiя '+allt(psser)+' номер '+allt(str(psnr,9))+' виданий '+dtous(psdtvr)+' '+subs(pskvr,1,19)+'│'
?'│'+space(78)+'│'+subs(pskvr,20,78)+'│'
?'└'+repl('─',78)+'┴'+repl('─',78)+'┘'
??chr(27)+'&l4C'
?' Вiд Орендаря:_______Директор ТОВ "Лодiс-Суми"___________________________       Вiд Суборендаря:__________________________________________________'
?' ____________________________________/_______В.Ю.Калюжний____________/          __________________________________/_______________________________/'
?'                                       М.П.                                                                     М.П.'
?'Погоджено Власником (ПАТ "Оболонь"; 04655, м. Київ, вул. Богатирська 3; п/р 26001501022777 в Київськiй РД "Райффайзен Банк Аваль", м. Київ, МФО 322904;'
?'код в ЄДРПОУ 05391057; IПН 053910526652; Св-во платника ПДВ № 100337037; тел. / факс (044) 593 19 49):'
?''
?'В особi ____ПАТ "Оболонь"__________________________________________'
?'___________________________________/____________________________/'
?'                           М.П.'
?'Третя сторiнка Договору суборенди майна №'+'18005'+'/'+str(ttnr,6)+' вiд '+dtous(dvpr)
eject
if kolposr>11
   ??chr(27)+'&l5C'
   ?space(84)+'Додаток до Договору суборенди майна №'+'18005'+'/'+str(ttnr,6)+' вiд '+dtous(dvpr)
   ?space(146)+'Сторiнка  1'
   ?space(70)+'Спецiфiкацiя'
   ?'м.Київ'+space(130)+dtous(dvpr)
   ?subs(getfield('t1','gnKkl_c','kln','nklprn'),1,110)+'(у подальшому именується "Орендар"), в особi'
   ?'директора Калюжного В.Ю.'+repl('_',55)+', що дiє на пiдставi статуту'+repl('_',26)+', з однiєї сторони, та'
  //   ?repl('_',80)+', що дiє на пiдставi '+repl('_',33)+', з однiєї сторони, та'
   ?subs(getfield('t1','kplr','kln','nklprn'),1,110)+'(у подальшому iменується "Суборендар"), в особi'
   ?repl('_',55)+', що дiє на пiдставi '+repl('_',33)+', з другої сторони, приймає в субаренду наступне'
   ?'торгово - рекламне обладнання (надалi iменується "Майно")'
   ??chr(27)+'&l3C'
   ?'┌───┬───────────────────────────────────────────┬──────────────┬───────────┬─────────┬──────────────┬──────┬───────────────────────────────────────────────┐'
   ?'│NN │       Перелiк та модель Майна             │  Заводський  │Iнвентарний│Кiлькiсть│Вартiсть Майна│ Рiк  │            Мiсцезнаходження Майна             │'
   ?'│   │                                           │ номер Майна  │номер Майна│  Майна, │  за одиницю  │вироб-│   (мiсто, вулиця, будинок, назва торговои     │'
   ?'│   │                                           │              │           │ одиниць │(грн. без ПДВ)│ництва│            точки з вивески)                   │'
   ?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
   nn_rr=1
   kol_rr=0
   sm_rr=0
   sele rs2
   if netseek('t3','ttnr')
      do while ttn=ttnr

adr_rr=alltrim(getfield('t1','kgpr','kln','adr'))
knasp_r=getfield('t1','kgpr','kln','knasp')
nnasp_r=alltrim(getfield('t1','knasp_r','knasp','nnasp'))
*adr_r=subs(nnasp_r+' '+adr_rr,1,47)
adr_r=padr(nnasp_r+' '+adr_rr,47,' ')

store '' to znr,zn1rr,zn2rr,zn3rr
znr=alltrim(getfield('t1','rs2->mntov','ctov','zn'))
kolstr=36
if len(znr)<=14
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+subs(getfield('t1','rs2->mntov','ctov','zn'),1,14)+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
  //   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','nat'),1,43)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','zn'),1,14)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
else
   zn1rr=subs(znr,1,10)
   fzn1r=padr(zn1rr,14)
   zn2rr=subs(znr,11,10)
   fzn2r=padr(zn2rr,14)
   zn3rr=subs(znr,21,10)
   fzn3r=padr(zn3rr,14)
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+fzn1r+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
   if !empty(zn2rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn2r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
   if !empty(zn3rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn3r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
endif

   ?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
           nn_rr=nn_rr+1
           kol_rr=kol_rr+rs2->kvp
           sm_rr=sm_rr+rs2->svp
           sele rs2
           skip
      endd
   endif
   for i=1 to kolstr-nn_rr
   ?'│   │XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│XXXXXXXXXXXXXX│XXXXXXXXXXX│XXXXXXXXX│XXXXXXXXXXXXXX│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
   ?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
     next
   ?'│   │ Всього:                                   │XXXXXXXXXXXXXX│XXXXXXXXXXX│'+str(kol_rr,9)+'│'+str(sm_rr,14,2)+'│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
   ?'└───┴───────────────────────────────────────────┴──────────────┴───────────┴─────────┴──────────────┴──────┴───────────────────────────────────────────────┘'
  //   ?'Вiдповiдно до Договору суборенди майна №'+'18005'+'/'+str(ttnr,6)+' вiд '+dtous(dvpr)
  //   ?'Зауважень до якостi, цiлiстностi та комплектностi отриманного Майна Суборендар не виявив'
  //   ?'Передане в субаренду Майно є власнистю ПАТ "Оболонь"(Власник Майна).'
  //   ??chr(27)+'&l3C'
   ?'┌'+repl('─',78)+'┬'+repl('─',78)+'┐'
   ?'│'+padc('Орендар:',78)+'│'+padc('Cуборендар:',78)+'│'
   ?'│'+'Найменування:'+subs(getfield('t1','gnKkl_c','kln','nklprn'),1,65)+'│'+'Найменування:'+subs(getfield('t1','kplr','kln','nklprn'),1,65)+'│'
   ?'│'+'Адреса:'+subs(getfield('t1','gnKkl_c','kln','adr'),1,71)+'│'+'Адреса:'+subs(getfield('t1','kplr','kln','adr'),1,71)+'│'
   ?'│'+'Телефон: '+getfield('t1','gnKkl_c','kln','tlf')+' Факс: '+space(52)+'│'+'Телефон: '+getfield('t1','kplr','kln','tlf')+' Факс: '+space(52)+'│'
   ?'│'+'Код в ЄДРПОУ '+str(getfield('t1','gnKkl_c','kln','kkl1'),10)+' IПН '+str(getfield('t1','gnKkl_c','kln','nn'),12)+space(38)+'│'+'Код в ЄДРПОУ '+str(getfield('t1','kplr','kln','kkl1'),10)+' IПН '+str(getfield('t1','kplr','kln','nn'),12)+space(38)+'│'
   ?'│'+'Св-во платника ПДВ '+getfield('t1','gnKkl_c','kln','nsv')+' п/р '+getfield('t1','gnKkl_c','kln','ns1nds')+space(19)+'│'+'Св-во платника ПДВ '+getfield('t1','kplr','kln','nsv')+' п/р '+getfield('t1','kplr','kln','ns1nds')+space(19)+'│'
   ?'│'+'в '+getfield('t1','kob1r','banks','otb')+' МФО '+str(val(kob1r),6)+space(25)+'│'+'в '+getfield('t1','kob2r','banks','otb')+' МФО '+str(val(kob2r),6)+space(25)+'│'
   ?'│'+space(78)+'│Паспорт: серiя '+allt(psser)+' номер '+allt(str(psnr,9))+' виданий '+dtous(psdtvr)+' '+subs(pskvr,1,19)+'│'
   ?'│'+space(78)+'│'+subs(pskvr,20,78)+'│'
   ?'└'+repl('─',78)+'┴'+repl('─',78)+'┘'
   ??chr(27)+'&l4C'
   ?' Вiд Орендаря:_______Директор ТОВ "Лодiс-Суми"___________________________       Вiд Суборендаря:__________________________________________________'
   ?' ____________________________________/_______В.Ю.Калюжний____________/          __________________________________/_______________________________/'
   ?'                                       М.П.                                                                     М.П.'
   ?'Погоджено Власником (ПАТ "Оболонь"; 04655, м. Київ, вул. Богатирська 3; п/р 26001501022777 в Київськiй РД "Райффайзен Банк Аваль", м. Київ, МФО 322904;'
   ?'код в ЄДРПОУ 05391057; IПН 053910526652; Св-во платника ПДВ № 100337037; тел. / факс (044) 593 19 49):'
   ?''
   ?'В особi ____ПАТ "Оболонь"__________________________________________'
   ?'___________________________________/____________________________/'
   ?'                           М.П.'
   eject
endif
??chr(27)+'&l5C'
*?'Типова форма N2'
?'Типова форма N1'+space(65)+'Акт'
?'м.Київ'+space(54)+'прийому - передачi Майна в суборенду'+space(40)+dtous(dvpr)
*?'м.Київ'+space(130)+dtous(dvpr)
?subs(getfield('t1','gnKkl_c','kln','nklprn'),1,110)+'(у подальшому именується "Орендар"), в особi'
?'директора Калюжного В.Ю.'+repl('_',55)+', що дiє на пiдставi статуту'+repl('_',26)+', з однiєї сторони, та'
*?repl('_',80)+', що дiє на пiдставi '+repl('_',33)+', з однiєї сторони, та'
?subs(getfield('t1','kplr','kln','nklprn'),1,110)+'(у подальшому iменується "Суборендар"), в особi'
?repl('_',55)+', що дiє на пiдставi '+repl('_',33)+', з другої сторони, приймає в субаренду наступне'
?'торгово - рекламне обладнання (надалi iменується "Майно")'
??chr(27)+'&l3C'
?'┌───┬───────────────────────────────────────────┬──────────────┬───────────┬─────────┬──────────────┬──────┬───────────────────────────────────────────────┐'
?'│NN │       Перелiк та модель Майна             │  Заводський  │Iнвентарний│Кiлькiсть│Вартiсть Майна│ Рiк  │            Мiсцезнаходження Майна             │'
?'│   │                                           │ номер Майна  │номер Майна│  Майна, │  за одиницю  │вироб-│   (мiсто, вулиця, будинок, назва торговои     │'
?'│   │                                           │              │           │ одиниць │(грн. без ПДВ)│ництва│            точки з вивески)                   │'
?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
nn_rr=1
kol_rr=0
sm_rr=0
sele rs2
if netseek('t3','ttnr')
   do while ttn=ttnr
adr_rr=alltrim(getfield('t1','kgpr','kln','adr'))
knasp_r=getfield('t1','kgpr','kln','knasp')
nnasp_r=alltrim(getfield('t1','knasp_r','knasp','nnasp'))
*adr_r=subs(nnasp_r+' '+adr_rr,1,47)
adr_r=padr(nnasp_r+' '+adr_rr,47,' ')
store '' to znr,zn1rr,zn2rr,zn3rr
znr=alltrim(getfield('t1','rs2->mntov','ctov','zn'))
kolstr=36
if len(znr)<=14
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+subs(getfield('t1','rs2->mntov','ctov','zn'),1,14)+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
  //   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','nat'),1,43)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','zn'),1,14)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
  //   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','nat'),1,43)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','zn'),1,14)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
else
   zn1rr=subs(znr,1,10)
   fzn1r=padr(zn1rr,14)
   zn2rr=subs(znr,11,10)
   fzn2r=padr(zn2rr,14)
   zn3rr=subs(znr,21,10)
   fzn3r=padr(zn3rr,14)
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+fzn1r+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
   if !empty(zn2rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn2r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
   if !empty(zn3rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn3r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
endif

?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
        nn_rr=nn_rr+1
        kol_rr=kol_rr+rs2->kvp
        sm_rr=sm_rr+rs2->svp
        sele rs2
        skip
   endd
endif
for i=1 to kolstr-nn_rr
?'│   │XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│XXXXXXXXXXXXXX│XXXXXXXXXXX│XXXXXXXXX│XXXXXXXXXXXXXX│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
  next
?'│   │ Всього:                                   │XXXXXXXXXXXXXX│XXXXXXXXXXX│'+str(kol_rr,9)+'│'+str(sm_rr,14,2)+'│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
?'└───┴───────────────────────────────────────────┴──────────────┴───────────┴─────────┴──────────────┴──────┴───────────────────────────────────────────────┘'
?'Вiдповiдно до Договору суборенди майна №'+'18005'+'/'+str(ttnr,6)+' вiд '+dtous(dvpr)
?'Зауважень до якостi, цiлiстностi та комплектностi отриманного Майна Суборендар не виявив'
?'Передане в субаренду Майно є власнистю ПАТ "Оболонь"(Власник Майна).'
??chr(27)+'&l3C'
?'┌'+repl('─',78)+'┬'+repl('─',78)+'┐'
?'│'+padc('Орендар:',78)+'│'+padc('Cуборендар:',78)+'│'
?'│'+'Найменування:'+subs(getfield('t1','gnKkl_c','kln','nklprn'),1,65)+'│'+'Найменування:'+subs(getfield('t1','kplr','kln','nklprn'),1,65)+'│'
?'│'+'Адреса:'+subs(getfield('t1','gnKkl_c','kln','adr'),1,71)+'│'+'Адреса:'+subs(getfield('t1','kplr','kln','adr'),1,71)+'│'
?'│'+'Телефон: '+getfield('t1','gnKkl_c','kln','tlf')+' Факс: '+space(52)+'│'+'Телефон: '+getfield('t1','kplr','kln','tlf')+' Факс: '+space(52)+'│'
?'│'+'Код в ЄДРПОУ '+str(getfield('t1','gnKkl_c','kln','kkl1'),10)+' IПН '+str(getfield('t1','gnKkl_c','kln','nn'),12)+space(38)+'│'+'Код в ЄДРПОУ '+str(getfield('t1','kplr','kln','kkl1'),10)+' IПН '+str(getfield('t1','kplr','kln','nn'),12)+space(38)+'│'
?'│'+'Св-во платника ПДВ '+getfield('t1','gnKkl_c','kln','nsv')+' п/р '+getfield('t1','gnKkl_c','kln','ns1nds')+space(19)+'│'+'Св-во платника ПДВ '+getfield('t1','kplr','kln','nsv')+' п/р '+getfield('t1','kplr','kln','ns1nds')+space(19)+'│'
?'│'+'в '+getfield('t1','kob1r','banks','otb')+' МФО '+str(val(kob1r),6)+space(25)+'│'+'в '+getfield('t1','kob2r','banks','otb')+' МФО '+str(val(kob2r),6)+space(25)+'│'
?'│'+space(78)+'│Паспорт: серiя '+allt(psser)+' номер '+allt(str(psnr,9))+' виданий '+dtous(psdtvr)+' '+subs(pskvr,1,19)+'│'
?'│'+space(78)+'│'+subs(pskvr,20,78)+'│'
?'└'+repl('─',78)+'┴'+repl('─',78)+'┘'
??chr(27)+'&l4C'
?' Вiд Орендаря:_______Директор ТОВ "Лодiс-Суми"___________________________       Вiд Суборендаря:__________________________________________________'
?' ____________________________________/_______В.Ю.Калюжний____________/          __________________________________/_______________________________/'
?'                                       М.П.                                                                     М.П.'
?'Погоджено Власником (ПАТ "Оболонь"; 04655, м. Київ, вул. Богатирська 3; п/р 26001501022777 в Київськiй РД "Райффайзен Банк Аваль", м. Київ, МФО 322904;'
?'код в ЄДРПОУ 05391057; IПН 053910526652; Св-во платника ПДВ № 100337037; тел. / факс (044) 593 19 49):'
?''
?'В особi ____ПАТ "Оболонь"__________________________________________'
?'___________________________________/____________________________/'
?'                           М.П.'
eject
return .t.
***************
func arfrmn(p1)
  // из субаренды
  // p1=1 Свой акт
***************
if empty(p1)
   prsvr=0
else
   prsvr=1
endif
kob1r=getfield('t1','gnKkl_c','kln','kb1')
kob2r=getfield('t1','kplr','kln','kb1')
psser=getfield('t1','kplr','kln','psse')
psnr=getfield('t1','kplr','kln','psn')
psdtvr=getfield('t1','kplr','kln','psdtv')
pskvr=getfield('t1','kplr','kln','pskv')
??chr(27)+'&l5C'
*?'Типова форма N1'
if prsvr=0
   ?'Типова форма N1'+space(65)+'Акт'
else
   ?space(15)+space(65)+'Акт'
endif
if prsvr=0
   ?'м.Київ'+space(54)+'прийому - передачi Майна iз суборенди'+space(40)+dtous(dvpr)
else
   ?'      '+space(54)+'прийому - передачi Майна iз суборенди'+space(40)+dtous(dvpr)
endif
*?'м.Київ'+space(130)+dtous(dvpr)
?subs(getfield('t1','gnKkl_c','kln','nklprn'),1,110)+'(у подальшому именується "Орендар"), в особi'
?'директора Калюжного В.Ю.'+repl('_',55)+', що дiє на пiдставi статуту'+repl('_',26)+', з однiєї сторони, та'
*?repl('_',80)+', що дiє на пiдставi '+repl('_',33)+', з однiєї сторони, та'
?subs(getfield('t1','kplr','kln','nklprn'),1,110)+'(у подальшому iменується "Суборендар"), в особi'
?repl('_',55)+', що дiє на пiдставi '+repl('_',33)+', з другої сторони, передає iз субаренди наступне'
?'торгово - рекламне обладнання (надалi iменується "Майно")'
??chr(27)+'&l3C'
?'┌───┬───────────────────────────────────────────┬──────────────┬───────────┬─────────┬──────────────┬──────┬───────────────────────────────────────────────┐'
?'│NN │       Перелiк та модель Майна             │  Заводський  │Iнвентарний│Кiлькiсть│Вартiсть Майна│ Рiк  │            Мiсцезнаходження Майна             │'
?'│   │                                           │ номер Майна  │номер Майна│  Майна, │  за одиницю  │вироб-│   (мiсто, вулиця, будинок, назва торговои     │'
?'│   │                                           │              │           │ одиниць │(грн. без ПДВ)│ництва│            точки з вивески)                   │'
?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
nn_rr=1
kol_rr=0
sm_rr=0
sele rs2
if netseek('t3','ttnr')
   do while ttn=ttnr

adr_rr=alltrim(getfield('t1','kgpr','kln','adr'))
knasp_r=getfield('t1','kgpr','kln','knasp')
nnasp_r=alltrim(getfield('t1','knasp_r','knasp','nnasp'))
*adr_r=subs(nnasp_r+' '+adr_rr,1,47)
adr_r=padr(nnasp_r+' '+adr_rr,47,' ')
store '' to znr,zn1rr,zn2rr,zn3rr
znr=alltrim(getfield('t1','rs2->mntov','ctov','zn'))
kolstr=36
if len(znr)<=14
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+subs(getfield('t1','rs2->mntov','ctov','zn'),1,14)+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
  //  ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','nat'),1,43)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','zn'),1,14)+'│'+subs(getfield('t1','sklr,rs2->ktl','tov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
else
   zn1rr=subs(znr,1,10)
   fzn1r=padr(zn1rr,14)
   zn2rr=subs(znr,11,10)
   fzn2r=padr(zn2rr,14)
   zn3rr=subs(znr,21,10)
   fzn3r=padr(zn3rr,14)
   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+fzn1r+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
   if !empty(zn2rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn2r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
   if !empty(zn3rr)
      ?'│'+space(3)+'│'+space(43)+'│'+fzn3r+'│'+space(11)+'│'+space(9)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
      kolstr=kolstr-1
   endif
endif

?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
        nn_rr=nn_rr+1
        kol_rr=kol_rr+rs2->kvp
        sm_rr=sm_rr+rs2->svp
        sele rs2
        skip
   endd
endif
if prsvr=0
   for i=1 to kolstr-nn_rr
   ?'│   │XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│XXXXXXXXXXXXXX│XXXXXXXXXXX│XXXXXXXXX│XXXXXXXXXXXXXX│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
   ?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
   next
else
  //   ?'├───┼───────────────────────────────────────────┼──────────────┼───────────┼─────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
endif
?'│   │ Всього:                                   │XXXXXXXXXXXXXX│XXXXXXXXXXX│'+str(kol_rr,9)+'│'+str(sm_rr,14,2)+'│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
?'└───┴───────────────────────────────────────────┴──────────────┴───────────┴─────────┴──────────────┴──────┴───────────────────────────────────────────────┘'
?'Вiдповiдно до Договору суборенди майна №'+'18005'+'/_________________вiд_______________' //+str(ttnr,6)+' вiд '+dtous(dvpr)
if prsvr=0
   ?'Зауважень до якостi, цiлiстностi та комплектностi отриманного Майна Суборендар не виявив'
else
   ?'Зауваження до технiчного стану переданного майна____________________________________________________________________________________________________________'
   for i=1 to kolstr-nn_rr
   ?''
   ?'____________________________________________________________________________________________________________________________________________________________'
   next
endif
?'Передане в субаренду Майно є власнистю ПАТ "Оболонь"(Власник Майна).'
??chr(27)+'&l3C'
?'┌'+repl('─',78)+'┬'+repl('─',78)+'┐'
?'│'+padc('Орендар:',78)+'│'+padc('Cуборендар:',78)+'│'
?'│'+'Найменування:'+subs(getfield('t1','gnKkl_c','kln','nklprn'),1,65)+'│'+'Найменування:'+subs(getfield('t1','kplr','kln','nklprn'),1,65)+'│'
?'│'+'Адреса:'+subs(getfield('t1','gnKkl_c','kln','adr'),1,71)+'│'+'Адреса:'+subs(getfield('t1','kplr','kln','adr'),1,71)+'│'
?'│'+'Телефон: '+getfield('t1','gnKkl_c','kln','tlf')+' Факс: '+space(52)+'│'+'Телефон: '+getfield('t1','kplr','kln','tlf')+' Факс: '+space(52)+'│'
?'│'+'Код в ЄДРПОУ '+str(getfield('t1','gnKkl_c','kln','kkl1'),10)+' IПН '+str(getfield('t1','gnKkl_c','kln','nn'),12)+space(38)+'│'+'Код в ЄДРПОУ '+str(getfield('t1','kplr','kln','kkl1'),10)+' IПН '+str(getfield('t1','kplr','kln','nn'),12)+space(38)+'│'
?'│'+'Св-во платника ПДВ '+getfield('t1','gnKkl_c','kln','nsv')+' п/р '+getfield('t1','gnKkl_c','kln','ns1nds')+space(19)+'│'+'Св-во платника ПДВ '+getfield('t1','kplr','kln','nsv')+' п/р '+getfield('t1','kplr','kln','ns1nds')+space(19)+'│'
?'│'+'в '+getfield('t1','kob1r','banks','otb')+' МФО '+str(val(kob1r),6)+space(25)+'│'+'в '+getfield('t1','kob2r','banks','otb')+' МФО '+str(val(kob2r),6)+space(25)+'│'
?'│'+space(78)+'│Паспорт: серiя '+allt(psser)+' номер '+allt(str(psnr,9))+' виданий '+dtous(psdtvr)+' '+subs(pskvr,1,19)+'│'
?'│'+space(78)+'│'+subs(pskvr,20,78)+'│'
?'└'+repl('─',78)+'┴'+repl('─',78)+'┘'
??chr(27)+'&l4C'
?' Вiд Орендаря:_______Директор ТОВ "Лодiс-Суми"___________________________       Вiд Суборендаря:__________________________________________________'
?' ____________________________________/_______В.Ю.Калюжний____________/          __________________________________/_______________________________/'
?'                                       М.П.                                                                     М.П.'
?'Погоджено Власником (ПАТ "Оболонь"; 04655, м. Київ, вул. Богатирська 3; п/р 26001501022777 в Київськiй РД "Райффайзен Банк Аваль", м. Київ, МФО 322904;'
?'код в ЄДРПОУ 05391057; IПН 053910526652; Св-во платника ПДВ № 100337037; тел. / факс (044) 593 19 49):'
?''
?'В особi ____ПАТ "Оболонь"__________________________________________'
?'___________________________________/____________________________/'
?'                           М.П.'
eject
return .t.

******************
func ardu()
  // Додаткова угода
******************
local i
  // 69 строк
??chr(27)+'E'+chr(27)+'&l4h25a0O'+chr(27)+'&l5C'+chr(27)+'&k2S'+chr(27)+'(3R'+chr(27)+'(s0p23.00h0s1b4102T'+chr(27)
*??chr(27)+'E'+chr(27)+'&l4h25a0O'+chr(27)+'&l5C'+chr(27)+'&k2S'+chr(27)+'(3R'+chr(27)+'(s0p20.00h0s1b4102T'+chr(27)
*??chr(27)+'E'+chr(27)+'&l1S'+chr(27)+'&l1h25a0O'+chr(27)+'&l3C'+chr(27)+'(3R'+chr(27)+'(s0p29.00h0s1b4102T'+chr(27)  // Книжная А4
cndogr=alltrim(getfield('t1','kplr','klndog','cndog'))
dtdogbr=getfield('t1','kplr','klndog','dtdogb')
if empty(cndogr)
   ndogr=getfield('t1','kplr','klndog','ndog')
   cndogr=alltrim(str(ndogr,6))
endif
??chr(27)+'&l5C'
?space(40)+'Додаткова угода'
?space(35)+'До договору поставки №'+'18005'+'/'+cndogr //str(ttnr,6)
?'м.Суми'+space(90)+dtous(dvpr)

?alltrim(getfield('t1','gnKkl_c','kln','nklprn'))+', далi "Продавець" в особi директора Калюжного Вадима Юрiйовича,що'
?''
?'дiє на пiдставi Статусу, та '+subs(getfield('t1','kplr','kln','nklprn'),1,66)+',далi "Покупець" в особi'
?''
?repl('_',99)+',що дiє на пiдставi'
?''
?repl('_',52)+'уклали дану Додаткову угоду до договору поставки №'+'18005'+'/'+cndogr+' вiд '
?''
?dtous(dtdogbr)+' про наступне:'
?''
?'  1. З метою сприяння продажу продукцiї, Продавець передає Покупцю торгове обладнання '
?'     (зокрема - холодильне обладнання, обладнання для розливу пива, iнше торговiльне'
?'     обладнання), надалi "Торгове обладнання" або "Обладнання". перелiк, кiлькiсть та iнша'
?'     iнформацiя щодо Обладнання, яке передається Покупцю, вказується у вiдповiдному Актi '
?'     приймання - передачi обладнання.'
?''
?'  2. Передача Покупцю Торгового обладнання не тягне за собою винекнення у Покупця та/або '
?'     субектiв роздрiбної торгiвлi права власностi на це Обладнання: власником Обладнання є'
?'     ПАТ "Оболонь", а Покупець використовує Торгове обладнання виключно для забезпечення'
?'     продажу продукцiї. Умови передачi та/або розмiщення обладнання в роздрiбнiй'
?'     торгiвельнiй мережi зазаначається в Актi приймання - передачi, згiдно якого Обладнання'
?'     передається Покупцю.'
?''
?'  3. Обладнання надається Покупцю виключно для популяризацiї, демонстрацiї, зберiгання, '
?'     передпродажної пiдготовки та реалiзацiї продукцiї Торгової марки "Оболонь", що '
?'     реалiзується Продавцем. Покупець не має права використовувати обладнання для iнших'
?'     цiлей, окрiм як з метою, що передбачена даною угодою. '
?''
?'  4. Покупець зoбовязаний повернути Обладнання в належному станi Продавцю в день'
?'     закiнчення договору, або не пiзнiше 3 днiв пiсля вiдправлення йому Продавцем'
?'     вiдповiдної вимоги.'
?''
?'  5. Покупець зобовязується вiдшкодувати Продавцю збитки в повному обсязi в разi '
?'     пошкодження Обладнання.'
// +' а саме:'
?''
//                 04-21-17 01:59pm
//?'       при використаннi майна меньше 5 рокiв - в повному обсязi;'
//?'      - при використаннi майна меньше 5 рокiв - за первiсною вартiстю;'
//?''
//?'      - при використаннi майна бiльше 5 рокiв - за реальною залишковою вартiстю, але'
//?'        не нижче 30% вiд первiсної вартiстi'
/*                 04-21-17 01:59pm
?'       при використаннi майна бiльше 5 рокiв - за залишковою вартiстю, але не меньше:'
?''
?'           - для холодильного обладнання - 408 грн. з ПДВ;'
?''
?'           - для розливного обладнання   - 204 грн. з ПДВ;'
?''
?'           - все iнше обладнання         - 102 грн. з ПДВ'
?''
*/
?space(40)+'Реквiзiти сторiн'

kob1r=getfield('t1','gnKkl_c','kln','kb1')
kob2r=getfield('t1','kplr','kln','kb1')
psser=getfield('t1','kplr','kln','psse')
psnr=getfield('t1','kplr','kln','psn')
psdtvr=getfield('t1','kplr','kln','psdtv')
pskvr=getfield('t1','kplr','kln','pskv')
// ??chr(27)+'E'+chr(27)+'&l1h25a0O'+chr(27)+'&l3C'+chr(27)+'(3R'+chr(27)+'(s0p29.00h0s1b4102T'+chr(27)  // Книжная А4
??chr(27)+'(3R'+chr(27)+'(s0p29.00h0s1b4102T'
??chr(27)+'&l3C'
?'┌'+repl('─',78)+'┬'+repl('─',78)+'┐'
?'│'+padc('Продавець:',78)+'│'+padc('Покупець',78)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+'Найменування:'+subs(getfield('t1','gnKkl_c','kln','nklprn'),1,65)+'│'+'Найменування:'+subs(getfield('t1','kplr','kln','nklprn'),1,65)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+'Адреса:'+subs(getfield('t1','gnKkl_c','kln','adr'),1,71)+'│'+'Адреса:'+subs(getfield('t1','kplr','kln','adr'),1,71)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+'Телефон: '+getfield('t1','gnKkl_c','kln','tlf')+' Факс: '+space(52)+'│'+'Телефон: '+getfield('t1','kplr','kln','tlf')+' Факс: '+space(52)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+'Код в ЄДРПОУ '+str(getfield('t1','gnKkl_c','kln','kkl1'),10)+' IПН '+str(getfield('t1','gnKkl_c','kln','nn'),12)+space(38)+'│'+'Код в ЄДРПОУ '+str(getfield('t1','kplr','kln','kkl1'),10)+' IПН '+str(getfield('t1','kplr','kln','nn'),12)+space(38)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+'Св-во платника ПДВ '+getfield('t1','gnKkl_c','kln','nsv')+space(39)+'│'+'Св-во платника ПДВ '+getfield('t1','kplr','kln','nsv')+space(39)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+'п/р '+getfield('t1','gnKkl_c','kln','ns1')+space(54)+'│'+'п/р '+getfield('t1','kplr','kln','ns1')+space(54)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+'в '+getfield('t1','kob1r','banks','otb')+' МФО '+str(val(kob1r),6)+space(25)+'│'+'в '+getfield('t1','kob2r','banks','otb')+' МФО '+str(val(kob2r),6)+space(25)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+space(78)+'│Паспорт: серiя '+allt(psser)+' номер '+allt(str(psnr,9))+' виданий '+dtous(psdtvr)+' '+subs(pskvr,1,19)+'│'
?'│'+space(78)+'│'+space(78)+'│'
?'│'+space(78)+'│'+subs(pskvr,20,78)+'│'
?'└'+repl('─',78)+'┴'+repl('─',78)+'┘'
//?'│'+space(78)+'│'+space(78)+'│'
??chr(27)+'&l4C'
?''
?' Вiд Продавця:_______Директор ТОВ "Лодiс-Суми"___________________________       Вiд Покупця:__________________________________________________'
?''
?''
?' ____________________________________/_______В.Ю.Калюжний____________/          __________________________________/_______________________________/'
?''
?'                                       М.П.                                                                     М.П.'
?str(ttnr,6)
?''
eject
return .t.

****************************
  func araktto()
  // Акт передачи в субаренду
  ****************************
  ??chr(27)+'E'+chr(27)+'&l4h25a0O'+chr(27)+'&l5C'+chr(27)+'&k2S'+chr(27)+'(3R'+chr(27)+'(s0p29.00h0s1b4102T'+chr(27)
  ??chr(27)+'&l5C'
  ?space(70)+'Акт № '+str(ttnr,6)
  ?'м.Київ'+space(54)+'прийому - передачi Обладнання'+space(40)+dtous(dvpr)
  ?''
  ?alltrim(getfield('t1','gnKkl_c','kln','nklprn'))+'(у подальшому iменуеться "Продавець") в особi директора Калюжного Вадима Юрiйовича,що'
  ?'дiє на пiдставi Статусу з однiєї сторони передає, а '+subs(getfield('t1','kplr','kln','nklprn'),1,66)+'(у подальшому iменуеться "Користувач") '
  ?''
  ?'в особi'+repl('_',126)+',що дiє на пiдставi'
  ?''
  ?repl('_',68)+'з другої сторони приймає наступне торгове обладнання (надалi iменується "Обладнання")'

  ??chr(27)+'&l3C'
  ?''
  ?'┌───┬───────────────────────────────────────────┬─────────┬──────────────┬───────────┬──────────────┬──────┬───────────────────────────────────────────────┐'
  ?'│NN │        Перелiк та модель Обладнання       │Кiлькiсть│  Заводський  │Iнвентарний│Вартiсть Обл. │ Рiк  │      Фактична адреса торгової точки           │'
  ?'│   │                                           │   Обл.  │ номер Обл.   │номер Обл. │  за одиницю  │введ в│   (мiсто, вулиця, будинок, назва торгової     │'
  ?'│   │                                           │ одиниць │              │           │(грн. без ПДВ)│експл.│            точки з вивiски)                   │'
  ?'├───┼───────────────────────────────────────────┼─────────┼──────────────┼───────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
  nn_rr=1
  kol_rr=0
  sm_rr=0
  sele rs2
  if netseek('t3','ttnr')
     do while ttn=ttnr
  adr_rr=alltrim(getfield('t1','kgpr','kln','adr'))
  knasp_r=getfield('t1','kgpr','kln','knasp')
  nnasp_r=alltrim(getfield('t1','knasp_r','knasp','nnasp'))
  //adr_r=subs(nnasp_r+' '+adr_rr,1,47)
  adr_r=padr(nnasp_r+' '+adr_rr,47,' ')
  store '' to znr,zn1rr,zn2rr,zn3rr
  znr=alltrim(getfield('t1','rs2->mntov','ctov','zn'))
  kolstr=15
  if len(znr)<=14
  //   ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+subs(getfield('t1','rs2->mntov','ctov','zn'),1,14)+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->kvp,9)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
     ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+str(rs2->kvp,9)+'│'+subs(getfield('t1','rs2->mntov','ctov','zn'),1,14)+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
  else
     zn1rr=subs(znr,1,10)
     fzn1r=padr(zn1rr,14)
     zn2rr=subs(znr,11,10)
     fzn2r=padr(zn2rr,14)
     zn3rr=subs(znr,21,10)
     fzn3r=padr(zn3rr,14)
     ?'│'+str(nn_rr,3)+'│'+subs(getfield('t1','rs2->mntov','ctov','nat'),1,43)+'│'+str(rs2->kvp,9)+'│'+fzn1r+'│'+subs(getfield('t1','rs2->mntov','ctov','znom'),1,11)+'│'+str(rs2->zen,14,3)+'│ '+str(year(getfield('t1','rs2->mntov','ctov','dizg')),4)+' │'+adr_r+'│'
     if !empty(zn2rr)
        ?'│'+space(3)+'│'+space(43)+'│'+space(9)+'│'+fzn2r+'│'+space(11)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
        kolstr=kolstr-1
     endif
     if !empty(zn3rr)
        ?'│'+space(3)+'│'+space(43)+'│'+space(9)+'│'+fzn3r+'│'+space(11)+'│'+space(14)+'│ '+space(4)+' │'+space(47)+'│'
        kolstr=kolstr-1
     endif
  endif

  ?'├───┼───────────────────────────────────────────┼─────────┼──────────────┼───────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
          nn_rr=nn_rr+1
          kol_rr=kol_rr+rs2->kvp
          sm_rr=sm_rr+rs2->svp
          sele rs2
          skip
     endd
  endif
  for i=1 to kolstr-nn_rr
  ?'│   │XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│XXXXXXXXX│XXXXXXXXXXXXXX│XXXXXXXXXXX│XXXXXXXXXXXXXX│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
  ?'├───┼───────────────────────────────────────────┼─────────┼──────────────┼───────────┼──────────────┼──────┼───────────────────────────────────────────────┤'
    next
  ?'│   │                                 РАЗОМ     │'+str(kol_rr,9)+'│XXXXXXXXXXXXXX│XXXXXXXXXXX│'+str(sm_rr,14,2)+'│XXXXXX│XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX│'
  ?'└───┴───────────────────────────────────────────┴─────────┴──────────────┴───────────┴──────────────┴──────┴───────────────────────────────────────────────┘'
  ?'  Користувач повiдомлений, що право власностi на Обладнання належить ПрАТ "Оболонь" (надалi - Власник). Власник має право в будь - який момент часу вимагати'
  ?'вiд Користувача повернення Обладнання, а Користувач зобовязується повернути Обладнання Власнику протягом 10(десяти) робочих днiв з дати направлення  Власни-'
  ?"ком Користувачу такої вимoги або, за умови наявностi вiдповiдної вимоги вiд Власника, Користувач зобов'язується пiдписати вiдповiдний договiр/додаткову уго-"
  ?"ду або iнший  документ (який регламентуватеме права та обов'язки щодо використання Обладнання) за участю iншої особи, яка Визначається  Власником, а також  "
  ?"переукласти з такою особою аналогiчний Акт приймання-передачi Обладнання. У випадку повернення Обладнання Користувачем Власнику, таке повернення оформлюєть-"
  ?"ся Актом повернення Обладнная, який пiдписується мiж Користувачем та Власником, при цьому Продавець не мае права перешкоджати такому поверненню."
  ?"  У випадку наявностi вiдповiдної письмової вимоги вiд Вланика, Користувач не має права повертати Обладнання, вказанне в цьому Актi приймання-передачi, Про-"
  ?"давцю, в протилежному випадку Власник має право вимагати вiд Користувача вiдшкодування вартостi такого Обладнання,що зазначена в данну Актi (з втр ПДВ)."
  ?'  Обладнання надається Користовачу виключно для популяризацiї, демонстрацiї, зберiгання, передпродажної пiдготовки та реализацiї продукцiї, що  виробляється'
  ?"або постачається Продавцю Власником, а Користувач зобов'язаний забеспечети всi умови, необхiднi для досягнення вказанних цiлей,  зокрема, але  не  виключно,"
  ?'забеспечети за власний рахунок увiмкненiсть холодильного обладнання та/або охолоджувачiв, забеспечити чистоту та належний зовнiшний вигляд Обладнання та iн.'
  ?'Користувач не має права використовувати обладнання для iнших цiлей, окрiм як з метою, що передбачена даним Актом'
  ?'  Користувач не має права без письмового узгодження iз Продавцем та Власником передавати Обладнання, або будь-яки  права  та обовязки по  Обладнанню  третiм'
  ?'особам.'
  ?'  Користувач забовязаний повернути Обладнання Продавцю/Власнику в тому ж самому станi, в якому воно було передано в користування ( з урахуванням нормального'
  ?'зносу).  Переобладнання,  переоснащення  ремонт, будь - якi полiпшення Обладнання тощо, можуть здiйснюватись Користувачем  виключно за попередньою письмовою'
  ?'згодою Продавц та/або Власника.'
  ?'  Користувач проiнформованний про те, що неповернення Обладнання Користувачем на вимогу Власника може буди визнате привласненням, розтратою, або  незаконним'
  ?'заволодiнням такого Обладнання, що може тягти за собою настання кримiнальної вiдповiдальностi.'
  ?'  Представники Продавця  або  Власника мають право здiйснювати необмежений контроль за використанням Обладнання з боку Користувача (як шляхом безпосередньої'
  ?'перевiрки порядку експлуатацiї Користувачем Обладнання i проведення iнвентарiзацiї, так i шляхом направлення Користовачу  вiдповiдних  запитив з вимогою про'
  ?'надання iнформацiї, i документiв, пiдтвержуючих поточний стан Обладнання, та порядок його використання). При необхидностi, контроль  цiльового  використання'
  ?'Обладнання можуть здiйснювати уповноваженi Продавцем та Власником посадовi особи Торгово - промислової палати України. Користувач забовязаний негайно забез-'
  ?'печити представникам Продавця, Власника або їх уповноваженим особам умови для безперешкодного доступу до Обладнання i, за их першою  вимогою, надати  им всi'
  ?'наявнi документи i iнформацию вiдносно есплуатации Обладнання.'
  ?''
  ?'  Зауважень до якостi, цiлiстностi та комплектацiї отриманного Обладнання Користувач не має.'
  ?''
  ??chr(27)+'(3R'+chr(27)+'(s0p29.00h0s1b4102T'
  ??chr(27)+'&l3C'
  kob1r=getfield('t1','gnKkl_c','kln','kb1')
  kob2r=getfield('t1','kplr','kln','kb1')
  psser=getfield('t1','kplr','kln','psse')
  psnr=getfield('t1','kplr','kln','psn')
  psdtvr=getfield('t1','kplr','kln','psdtv')
  pskvr=getfield('t1','kplr','kln','pskv')
  ?'┌'+repl('─',78)+'┬'+repl('─',78)+'┐'
  ?'│'+padc('Продавець:',78)+'│'+padc('Користувач',78)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+'Найменування:'+subs(getfield('t1','gnKkl_c','kln','nklprn'),1,65)+'│'+'Найменування:'+subs(getfield('t1','kplr','kln','nklprn'),1,65)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+'Адреса:'+subs(getfield('t1','gnKkl_c','kln','adr'),1,71)+'│'+'Адреса:'+subs(getfield('t1','kplr','kln','adr'),1,71)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+'Телефон: '+getfield('t1','gnKkl_c','kln','tlf')+' Факс: '+space(52)+'│'+'Телефон: '+getfield('t1','kplr','kln','tlf')+' Факс: '+space(52)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+'Код в ЄДРПОУ '+str(getfield('t1','gnKkl_c','kln','kkl1'),10)+' IПН '+str(getfield('t1','gnKkl_c','kln','nn'),12)+space(38)+'│'+'Код в ЄДРПОУ '+str(getfield('t1','kplr','kln','kkl1'),10)+' IПН '+str(getfield('t1','kplr','kln','nn'),12)+space(38)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+'Св-во платника ПДВ '+getfield('t1','gnKkl_c','kln','nsv')+space(39)+'│'+'Св-во платника ПДВ '+getfield('t1','kplr','kln','nsv')+space(39)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+'п/р '+getfield('t1','gnKkl_c','kln','ns1')+space(54)+'│'+'п/р '+getfield('t1','kplr','kln','ns1')+space(54)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+'в '+getfield('t1','kob1r','banks','otb')+' МФО '+str(val(kob1r),6)+space(25)+'│'+'в '+getfield('t1','kob2r','banks','otb')+' МФО '+str(val(kob2r),6)+space(25)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+space(78)+'│Паспорт: серiя '+allt(psser)+' номер '+allt(str(psnr,9))+' виданий '+dtous(psdtvr)+' '+subs(pskvr,1,19)+'│'
  ?'│'+space(78)+'│'+space(78)+'│'
  ?'│'+space(78)+'│'+subs(pskvr,20,78)+'│'
  ?'└'+repl('─',78)+'┴'+repl('─',78)+'┘'
  ??chr(27)+'&l4C'
  ?''
  ?' Вiд Продавця:_______Директор ТОВ "Лодiс-Суми"___________________________       Вiд Користувача:__________________________________________________'
  ?''
  ?''
  ?' ____________________________________/_______В.Ю.Калюжний____________/          __________________________________/_______________________________/'
  ?''
  ?'                                       М.П.                                                                     М.П.'
  ?''
  ?space(80)+'Власник ПрАТ "Оболонь"__________________________________________'
  ?space(80)+'___________________________________/____________________________/'
  ?space(80)+'                           М.П.'
  eject
  return .t.

*****************************
func araktfr()
  // Акт возврата из субаренды
  *****************************
  return .t.
