*****************************************************************************
** RZAG высвеч. загол.РАСХОДА                                               *
*****************************************************************************
@ 5,0 CLEA
@ 5,10 SAY '    Заголовок документа    '+STR(ttnr,6)
@ 6, 0 SAY ' 1. Дата выписки         : '+DTOC(DVPR)
@ 7, 0 SAY ' 2. Дата документа       : '+DTOC(DDCR)+' '+tdcr
@ 8, 0 SAY ' 3. Код плательщика      : '+STR(KPLR,7,0)+' '+nkplr 
@ 9, 0 SAY ' 4. Код грузополучателя  : '+STR(KGPR,7,0)+' '+nkgpr
@ 10,0 SAY ' 5. Код склада           : '+STR(SKLR,4,0)+' '+nsklr
@ 11,0 SAY ' 6. N договора           : '+NNZR
@ 12,0 SAY ' 7. Дата договора        : '+DTOC(DNZR)
@ 13,0 SAY ' 8. Код операции         : '+STR(KOPR,3,0)+' '+nopr
@ 14,0 SAY ' 9. Код способа доставки : '+STR(SPDR,2,0)
@ 15,0 SAY '10. Код вида оплаты      : '+STR(VOR,2,0)+' '+nvor
@ 16,0 SAY '11. Товаровед            : '+fktor
@ 17,0 SAY '12. Дата отгрузки        : '+DTOC(DOTR)+' '+totr
oclr=''
if przr=0
   oclr=setcolor('n/g')
   saw='НЕ подтвержден !'
else
   oclr=setcolor('w/r')
   saw='Подтвержден !'
endi
@ 17,50,19,67 box ''
@ 17,50,19,67 box frame
@ 18,51 say saw
oclr=setcolor(oclr)
@ 19,0 SAY '14. Сумма по документу  : '+STR(SDVR,15,2)
@ 20,0 SAY '15. Общий вес           : '+STR(VSVR,12,6)
VUR=INT(KOPR/100)
RETU
