para exer
clea
if empty(exer)
   ?'Запустите START.BAT'
   inkey(3)
   retu
endif
if upper(exer)#'S'
   ?'Запустите START.BAT'
   inkey(3)
   retu
endif

gnArm=3
gnPnds=2

priv menu[8]
MENU[3] := "Справ"
MENU[4] := "Приход"
MENU[5] := "Расход"
MENU[6] := "Остатки"
MENU[7] := "Сервис"
MENU[8] := "Доставка"

lmenur=len(menu)  // Количество pad
priv CL_L[lmenur]  // Позиция pad
priv sizam[lmenur] // Количество bar

priv menu3[11]
MENU3[1] := "Смена склада"
MENU3[2] := "SOPER       "
MENU3[3] := "Группы      "
MENU3[4] := "Сертификаты "
MENU3[5] := "Печать серт."
MENU3[6] := "Передача    "
MENU3[7] := "Прием       "
MENU3[8] := "Протокол    "
MENU3[9] := "Аренда      "
MENU3[10] := "КСПОВО      "
MENU3[11] := "Коды продукц"

priv menu4[18]
MENU4[1]  := "Поставщики       "
MENU4[2]  := "Возврат от магаз."
MENU4[3]  := "Возврат от покуп."
MENU4[4]  := "Переброска       "
MENU4[5]  := "Аренда           "
MENU4[6]  := "Ведомость прихода"
MENU4[7]  := "Удаление прихода "
MENU4[8]  := "Протокол прихода "
MENU4[9]  := "Автоматические   "
MENU4[10] := "Печать ценников  "
MENU4[11] := "Комиссия         "
MENU4[12] := "Прот.прод отв.хр."
MENU4[13] := "Пр.(авто) отв.хр."
MENU4[14] := "Пр.(ручн) отв.хр."
MENU4[15] := "Остатки по дням  "
MENU4[16] := "Остатки комисс.  "
MENU4[17] := "Прот перед отв.хр"
MENU4[18] := "Заказ СОХ (Лодис)"

priv menu5[22]
MENU5[1]  := "Покупатели           "
MENU5[2]  := "Магазины             "
MENU5[3]  := "Накладная в подотчет "
MENU5[4]  := "Возврат из подотчета "
MENU5[5]  := "Внутренняя переброска"
MENU5[6]  := "Акт на списание      "
MENU5[7]  := "Возврат поставщику   "
MENU5[8]  := "Аренда               "
MENU5[9]  := "Подтверждение        "
MENU5[10] := "Удаление расхода     "
MENU5[11] := "Ведомость расхода    "
MENU5[12] := "Ведомость тек. дня   "
MENU5[13] := "Комиссионная торговля"
MENU5[14] := "Ведомость вып докум. "
MENU5[15] := "Протокол             "
MENU5[16] := "Автоматические       "
MENU5[17] := "Протокол по воз. таре"
MENU5[18] := "Поиск по DOCGUID     "
MENU5[19] := "Заявки               "
MENU5[20] := "Подверждение списком "
MENU5[21] := "Отчеты комиcсионеров "
MENU5[22] := "Уценка               "

priv menu6[21]
MENU6[1] := "Остатки            "
MENU6[2] := "Ведомости остатков "
MENU6[3] := "Вед остат по товару"
MENU6[4] := "Оборотная ведомость"
MENU6[5] := "Ведомость цен      "
MENU6[6] := "Ведомость инвентар."
MENU6[7] := "Карта покупателя   "
MENU6[8] := "Дебеторка          "
MENU6[9] := "Контрольная сумма  "
MENU6[10]:= "Контроль отгрузки  "
MENU6[11]:= "Контроль заявок КПК"
MENU6[12]:= "Возврат тары       "
MENU6[13]:= "Печать прайсов     "
MENU6[14]:= "Ост отгр на день   "
MENU6[15]:= "Заявки КПК         "
MENU6[16]:= "Сбойные заявки КПК "
MENU6[17]:= "Возвраты КПК       "
MENU6[18]:= "Акции              "
MENU6[19]:= "Оплата по направл. "
MENU6[20]:= "Акт сверки по плате"
MENU6[21]:= "Акт сверки по ТА"

priv menu7[20]
MENU7[1] := "Индексация   "
MENU7[2] := "Переворот    "
MENU7[3] := "Корр.док.    "
MENU7[4] := "Остатки нач  "
MENU7[5] := "Остатки тек  "
MENU7[6] := "XXXXXXXXXXXXX"
MENU7[7] := "Отв хр корр  "
MENU7[8] := "Корр. RS2M   "
MENU7[9]  := "Корр. -OSV  "
MENU7[10] := "Корр. S92   "
MENU7[11] := "Док.по врем."
MENU7[12] := "Автоматы    "
MENU7[13] := "OSN,OSF пер."
  //MENU7[13] := "Прайсы архив"
MENU7[14] := "Поиск док   "
MENU7[15] := "Корр возв т "
MENU7[16] := "tmesto,ktas "
MENU7[17] := "Модиф. док  "
MENU7[18] := "361         "
MENU7[19] := "Мод 361     "
MENU7[20] := "Дв DOCGUID  "

priv menu8[7]
MENU8[1] := "Маршрутн листы"
MENU8[2] := "Доставка      "
MENU8[3] := "Маршруты      "
MENU8[4] := "Корр на начало"
MENU8[5] := "Корр текущая  "
MENU8[6] := "Возврат ТТН   "
MENU8[7] := "Просм возврата"

SIZAM[3] := len(menu3)
SIZAM[4] := len(menu4)
SIZAM[5] := len(menu5)
SIZAM[6] := len(menu6)
SIZAM[7] := len(menu7)
SIZAM[8] := len(menu8)

maine()
